[
  {
    "title": "BBC's Tim Davie praises journalism and says broadcaster will thrive",
    "url": "https://nypost.com/2025/11/11/world-news/bbcs-tim-davie-praises-journalism-and-says-broadcaster-will-thrive/",
    "source": "New York Post",
    "publishedAt": "2025-11-11T13:00:59Z",
    "content": "The outgoing boss of the BBC said he was \"very proud\" of the broadcaster's journalism, two days after he quit following accusations of bias and the threat of legal action from US President Donald Trump.",
    "summary": "The outgoing boss of the BBC said he was \"very proud\" of the broadcaster's journalism, two days after he quit following accusations of bias and the threat of legal action from US President Donald Trum...",
    "sentiment": "neutral"
  },
  {
    "title": "HOLD: Trump requests Supreme Court overturn verdict in E. Jean Carroll sexual abuse and defamation case",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-appeals-supreme-court-e-jean-carroll-judgement-sexual-abuse-rcna243124",
    "source": "NBC News",
    "publishedAt": "2025-11-11T12:57:07Z",
    "content": "President Donald Trump asked the Supreme Court on Monday to review a $5 million civil judgment that found him liable for sexually abusing and defaming writer E. Jean Carroll",
    "summary": "President Donald Trump asked the Supreme Court on Monday to review a $5 million civil judgment that found him liable for sexually abusing and defaming writer E. Jean Carroll",
    "sentiment": "neutral"
  },
  {
    "title": "'His days are numbered': Trump official blasted after 'publicly humiliating the president'",
    "url": "https://www.rawstory.com/his-days-are-numbered-trump-official-blasted-for-publicly-humiliating-the-president/",
    "source": "Raw Story",
    "publishedAt": "2025-11-11T12:52:57Z",
    "content": "One high-ranking official in President Donald Trump's administration may soon be headed for the exits after a policy pitch went sideways.Politico reported Monday that Bill Pulte — who is the director of the Federal Housing Finance Agency and the chairman of Fannie Mae and Freddie Mac — is behind Tru...",
    "summary": "One high-ranking official in President Donald Trump's administration may soon be headed for the exits after a policy pitch went sideways.Politico reported Monday that Bill Pulte — who is the director ...",
    "sentiment": "neutral"
  },
  {
    "title": "BBC vs Trump: The Transatlantic Tussle Over Broadcast Integrity",
    "url": "https://www.devdiscourse.com/article/entertainment/3693370-bbc-vs-trump-the-transatlantic-tussle-over-broadcast-integrity",
    "source": "Devdiscourse",
    "publishedAt": "2025-11-11T12:50:03Z",
    "content": "The British government is intervening in a dispute involving the BBC and former US President Donald Trump over a documentary's editing of his speech. Amidst escalating tensions, the BBC's leadership has resigned, admitting errors while receiving demands from Trump's lawyer for retractions and compensation.",
    "summary": "The British government is intervening in a dispute involving the BBC and former US President Donald Trump over a documentary's editing of his speech. Amidst escalating tensions, the BBC's leadership h...",
    "sentiment": "neutral"
  },
  {
    "title": "Outgoing BBC boss Tim Davie suggests BBC’s future will be ‘thriving’",
    "url": "https://www.independent.co.uk/tv/news/tim-davie-bbc-trump-lawsuit-video-b2862883.html",
    "source": "The Independent",
    "publishedAt": "2025-11-11T12:40:31Z",
    "content": "Tim Davie has said that the BBC’s future will be “thriving” in his first public remarks since he resigned from his position of director-general on Sunday (9 November). It comes after Donald Trump threatened to sue the corporation for $1 billion for “interfering in the presidential election” after it emerged it had selectively edited one of his speeches from 6 January 2021. Speaking outside Broadcasting House on Tuesday (11 November), Mr Davie said he was “very proud” of all the journalists who work for the BBC, and thanked them for doing a “wonderful job”. “I’m here to lead and support them. The BBC is going to be thriving and I support everyone of the team,” he added. He did not comment on Mr Trump’s threat to sue.",
    "summary": "Tim Davie has said that the BBC’s future will be “thriving” in his first public remarks since he resigned from his position of director-general on Sunday (9 November). It comes after Donald Trump thre...",
    "sentiment": "neutral"
  }
]